app/Controllers/Admin/Anggota.php

SELECT *
FROM `anggota`
ORDER BY `nomorBaju` DESC
 LIMIT 1
SELECT *
FROM `komunitas`
---
    public function index()
    {
        // dd(session()->get('komunitas'));
        $nomorBajuTerakhir = $this->AnggotaModel->orderBy('nomorBaju', 'DESC')->first();
        $nomorBajuBaru = sprintf("%04s", $nomorBajuTerakhir['nomorBaju'] + 1);
        return view('admin/anggota', [
            'judul' => 'Keanggotaan',
            'nomorBajuBaru' => $nomorBajuBaru,
            'validation' => \Config\Services::validation(),
            'listAnggota' => $this->RelationTable->getAnggotaByKomunitas(session()->get('komunitas')),