app/Controllers/Admin/JenisKerasulan.php

SELECT *
FROM `jenisKerasulan`
---
    public function index()
    {
        return view('superuser/jenisKerasulan', [
            'judul' => 'Jenis Kerasulan',
            'validation' => \Config\Services::validation(),
            'listJenisKerasulan' => $this->JenisKerasulanModel->findAll(),