app/Controllers/SuperAdmin/Anggota.php

SELECT *
FROM `anggota`
ORDER BY `nomorBaju` DESC
 LIMIT 1
SELECT *
FROM `komunitas`
---
    public function index()
    {
        $nomorBajuTerakhir = $this->AnggotaModel->orderBy('nomorBaju', 'DESC')->first();
        // dd($nomorBajuTerakhir['nomorBaju']);
        $nomorBajuBaru = sprintf("%04s", $nomorBajuTerakhir['nomorBaju'] + 1);

        return view('superadmin/anggota', [
            'judul' => 'Keanggotaan',
            'nomorBajuBaru' => $nomorBajuBaru,
            'validation' => \Config\Services::validation(),
            'listAnggota' => $this->RelationTable->getAnggotaAllWithoutRoleSuperAdmin(),
            'komunitas' => $this->KomunitasModel->findAll(),

SELECT *
FROM `anggota`
WHERE `anggota`.`id` = '31'
---
    public function update($id)
    {
        $nama = $this->request->getPost('nama');
        $tempatLahir = $this->request->getPost('tempatLahir');
        $tanggalLahir = $this->request->getPost('tanggalLahir');
        $nomorTelepon = $this->request->getPost('nomorTelepon');
        $password = $this->request->getPost('password');
        $status = $this->request->getPost('status');
        $role = $this->request->getPost('role');
        $anggota = $this->AnggotaModel->find($id);

UPDATE `anggota` SET `nama` = 'world doeeee', `password` = '$2y$10$jPClMdt5zFzQ20P4abzMQeCe.tie5uUvVR9uy4Fqc3oWH06aegvMe', `tempatLahir` = 'asd', `tanggalLahir` = '2023-12-31', `nomorTelepon` = '123123', `status` = 'eksklaustrasi', `role` = 'user', `foto` = 'foto-1687065711_6cf98a53cc7d63f82a14.jpg'
WHERE `anggota`.`id` IN ('31')
---
            unlink('upload/berkas/' . $anggota['berkasTerkait']);
        }

        $this->AnggotaModel->update($id, [
            'nama' => $nama,
            'password' => $password,
            'tempatLahir' => $tempatLahir,
            'tanggalLahir' => $tanggalLahir,
            'nomorTelepon' => $nomorTelepon,
            'status' => $status,
            'berkasTerkait' => $newNameFile,
            'role' => $role,
            'foto' => $newName
        ]);

SELECT *
FROM `komunitas`
SELECT *
FROM `tahapPembinaan`
SELECT *
FROM `penugasan`
SELECT *
FROM `pembinaan`
---
    public function detail($idAnggota)
    {
        // dd($idAnggota);
        // dd($this->RelationTable->getAnggotaById($idAnggota));
        return view('superAdmin/detailAnggota', [
            'judul' => 'Detail Anggota',
            'validation' => \Config\Services::validation(),
            'listPenugasan' => $this->RelationTable->listPenugasanByAnggota($idAnggota),
            'listPembinaan' => $this->RelationTable->listPembinaanByAnggota($idAnggota),
            'anggota' => $this->RelationTable->getAnggotaById($idAnggota),
            'listKomunitas' => $this->KomunitasModel->findAll(),
            'listTahapPembinaan' => $this->TahapPembinaanModel->findAll(),
            'editPenugasan' => $this->PenugasanModel->findAll(),
            'editPembinaan' => $this->PembinaanModel->findAll()

SELECT *
FROM `hasilBelajar`
WHERE `idAnggota` = '31'
---
    public function student($idAnggota)
    {
        // dd($this->HasilBelajarModel->where('idAnggota', $idAnggota)->findAll());
        return view('superAdmin/hasilBelajar', [
            'judul' => 'Hasil Belajar',
            'validation' => \Config\Services::validation(),
            'listHasilBelajar' => $this->HasilBelajarModel->where('idAnggota', $idAnggota)->findAll(),