app/Controllers/SuperAdmin/Beranda.php

SELECT *
FROM `Kegiatan`
---
    public function index()
    {
        return view('admin/beranda', [
            'judul' => 'Beranda',
            'listKegiatan' => $this->KegiatanModel->findAll(),