app/Controllers/SuperAdmin/Kegiatan.php

    public function index()
    {
        // $superAdminData = (session()->get('role') == 'superadmin') ? $this->RelationTable->getProvinsiByIdKomunitas(session()->get('komunitas')) : '';
        $data = [
            'judul' => 'Kegiatan Komunitas',
            'kegiatan' => $this->dataKegiatan,
            'validation' => \Config\Services::validation(),
            'listKegiatan' => $this->RelationTable->getKegiatan(),
            'listKomunitas' => $this->KomunitasModel->findAll(),
---
SELECT *
FROM `komunitas`

    public function update($id)
    {
        $judul = $this->request->getPost('judul');
        $deskripsi = $this->request->getPost('deskripsi');
        $tanggal = $this->request->getPost('tanggal');
        $idKomunitas = $this->request->getPost('idKomunitas');
        $thumbnail = $this->request->getFile('thumbnail');
        $newName = '';

        if (!$this->validate([
            'judul' => 'required',
            'deskripsi' => 'required',
            'tanggal' => 'required',

        ])) {
            session()->setFlashdata('msg-danger', 'Data gagal diubah!!!');
            return redirect()->to('sa/kegiatan/edit/' . $id)->withInput();
        }

        if ($thumbnail->getName() == '') {
            $newName = $this->KegiatanModel->find($id)['thumbnail'];
        }

        if ($thumbnail->isValid() && !$thumbnail->hasMoved()) {
            $newName = 'thumbnail-' . $thumbnail->getRandomName();
            $thumbnail->move($this->GaleriPath, $newName);
        }

        $this->KegiatanModel->update($id, [
            'idKomunitas' =>  $idKomunitas,
            'judul' =>  $judul,
            'deskripsi' =>  $deskripsi,
            'tanggal' =>  $tanggal,
            'thumbnail' => $newName
        ]);
---
SELECT *
FROM `Kegiatan`
WHERE `Kegiatan`.`id` = '27'
UPDATE `Kegiatan` SET `idKomunitas` = '1', `judul` = 'sadasdas asdsssssss', `deskripsi` = '<p>adasdasd</p>', `tanggal` = '2023-06-22', `thumbnail` = 'thumbnail-1687403592_1d68d53a64fe6685cafb.jpg'
WHERE `Kegiatan`.`id` IN ('27')

    public function galeriPage($idKegiatan)
    {
        $data = [
            'judul' => 'Kegiatan Komunitas',
            'idKegiatan' => $idKegiatan,
            'listGaleri' => $this->GaleriModel->where('idKegiatan', $idKegiatan)->findAll()
---
SELECT *
FROM `galeri`
WHERE `idKegiatan` = '27'