app/Controllers/SuperAdmin/Provinsi.php

  public function index()
  {
    return view('superadmin/provinsi', [
      'judul' => 'Provinsi',
      'validation' => \Config\Services::validation(),
      'listProvinsi' => $this->ProvinsiModel->findAll(),
---
SELECT *
FROM `provinsi`