app/Controllers/About.php

SELECT *
FROM `provinsi`
---
    public function index()
    {
        return view('about', [
            'judul' => 'About',
            'provinsi' => $this->ProvinsiModel->findAll(),
        ]);