app/Controllers/Auth.php

SELECT *
FROM `anggota`
WHERE `nomorBaju` = 'B-000'
 LIMIT 1
SELECT *
FROM `penugasan`
WHERE `idAnggota` = '1'
AND `penugasan`.`status` = 'Y'
ORDER BY `tanggalPenugasan` DESC
 LIMIT 1
---
    public function login()
    {

        // request form
        $username = $this->request->getPost('nomorBaju');
        $password = $this->request->getPost('password');
        $role = $this->request->getPost('role');

        // validation
        $rules = ['nomorBaju' => 'required', 'password' => 'required'];

        // validate form
        if (!$this->validate($rules)) {
            // $validation = \Config\Services::validation();
            return redirect()->to('auth')->withInput();
            // ->with('validation', $validation);
        }

        $AnggotaModel = new \App\Models\AnggotaModel();
        $PenugasanModel = new \App\Models\PenugasanModel();
        $getDataAnggota = $AnggotaModel->where('nomorBaju', $username)->first();
        if ($getDataAnggota) {
            $getPenugasan = $PenugasanModel->where('idAnggota', $getDataAnggota['id'])
                ->orderBy('tanggalPenugasan', 'DESC')
                ->where('penugasan.status', 'Y')
                ->first();