app/Controllers/Auth.php

    public function login()
    {

        // request form
        $username = $this->request->getPost('nomorBaju');
        $password = $this->request->getPost('password');
        $role = $this->request->getPost('role');

        // validation
        $rules = ['nomorBaju' => 'required', 'password' => 'required'];

        // validate form
        if (!$this->validate($rules)) {
            // $validation = \Config\Services::validation();
            return redirect()->to('auth')->withInput();
            // ->with('validation', $validation);
        }

        if ($role == 'superuser') {
            $getAdmin = $this->AdminModel->find(1);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = 1