app/Controllers/Beranda.php

  public function index()
  {
    return view('beranda', [
      'judul' => 'Beranda',
      'listKegiatan' => $this->RelationTable->getKegiatan(),
      'listGaleri' => $this->GaleriModel->findAll()
---
SELECT *
FROM `galeri`