app/Controllers/Kerasulan.php

SELECT *
FROM `jenisKerasulan`
---
  public function index()
  {
    return view('kerasulan', [
      'judul' => 'Kerasulan',
      'listKerasulan' => $this->RelationTable->listKerasulan(),
      'listJenisKerasulan' => $this->JenisKerasulanModel->findAll(),