app/Models/RelationTable.php

    public function getKegiatan()
    {
        return $this->db->table('kegiatan')->select('kegiatan.*, anggota.nama, anggota.foto')
            ->join('anggota', 'anggota.id = kegiatan.idAnggota')
            ->get()->getResultArray();
---
SELECT `kegiatan`.*, `anggota`.`nama`, `anggota`.`foto`
FROM `kegiatan`
JOIN `anggota` ON `anggota`.`id` = `kegiatan`.`idAnggota`

    public function listKerasulan()
    {
        return $this->db->table('kerasulan')
            ->select('kerasulan.*, jenisKerasulan.nama AS namaJenisKerasulan, komunitas.nama as namaKomunitas')
            ->join('jenisKerasulan', 'jenisKerasulan.id = kerasulan.idJenisKerasulan')
            ->join('komunitas', 'komunitas.id = kerasulan.idKomunitas')
            ->get()->getResultArray();
---
SELECT `kerasulan`.*, `jenisKerasulan`.`nama` AS `namaJenisKerasulan`, `komunitas`.`nama` as `namaKomunitas`
FROM `kerasulan`
JOIN `jenisKerasulan` ON `jenisKerasulan`.`id` = `kerasulan`.`idJenisKerasulan`
JOIN `komunitas` ON `komunitas`.`id` = `kerasulan`.`idKomunitas`

    public function riwayatPenugasan()
    {
        return $this->db->table('penugasan')
            ->select('penugasan.*, komunitas.nama')
            ->join('komunitas', 'komunitas.id = penugasan.idKomunitas')
            ->get()->getResultArray();
---
SELECT `penugasan`.*, `komunitas`.`nama`
FROM `penugasan`
JOIN `komunitas` ON `komunitas`.`id` = `penugasan`.`idKomunitas`

    public function tahapPembinaan()
    {
        return $this->db->table('pembinaan')
            ->select('pembinaan.*, tahapPembinaan.nama')
            ->join('tahapPembinaan', 'tahapPembinaan.id = pembinaan.idTahapPembinaan')
            ->get()->getResultArray();
---
SELECT `pembinaan`.*, `tahapPembinaan`.`nama`
FROM `pembinaan`
JOIN `tahapPembinaan` ON `tahapPembinaan`.`id` = `pembinaan`.`idTahapPembinaan`

    public function listPembinaanByAnggota($idAnggota)
    {
        return $this->db->table('pembinaan')
            ->select('pembinaan.*, tahapPembinaan.nama')
            ->join('tahapPembinaan', 'tahapPembinaan.id = pembinaan.idTahapPembinaan')
            ->orderBy('tanggalPembinaan', 'DESC')
            ->where('pembinaan.idAnggota', $idAnggota)
            ->get()->getResultArray();
---
SELECT `pembinaan`.*, `tahapPembinaan`.`nama`
FROM `pembinaan`
JOIN `tahapPembinaan` ON `tahapPembinaan`.`id` = `pembinaan`.`idTahapPembinaan`
WHERE `pembinaan`.`idAnggota` = '31'
ORDER BY `tanggalPembinaan` DESC

    public function getAnggotaById($idAnggota)
    {
        return $this->db->table('penugasan penA')
            ->select('anggota.*, penA.idAnggota, penA.idKomunitas, penA.tanggalPenugasan, penA.keterangan AS keteranganPenugasan, penA.status AS statusPenugasan, komunitas.nama AS namaKomunitas, pemA.idAnggota, pemA.idTahapPembinaan, pemA.tanggalPembinaan, tahapPembinaan.nama AS namaPembinaan, pemA.keterangan AS keteranganPembinaan, pemA.tanggalPembinaan, pemA.keterangan AS keteranganPembinaan')
            ->join('anggota', 'anggota.id = penA.idAnggota')
            ->join('komunitas', 'komunitas.id = penA.idKomunitas')
            ->join('pembinaan pemA', 'pemA.idAnggota = anggota.id')
            ->join('tahapPembinaan', 'tahappembinaan.id = pemA.idTahapPembinaan')
            ->where('penA.tanggalPenugasan = (SELECT MAX(tanggalPenugasan) FROM penugasan as penB where penA.idAnggota = penB.idAnggota)')
            ->where('pemA.tanggalPembinaan = (SELECT MAX(tanggalPembinaan) FROM pembinaan as pemB where pemA.idAnggota = pemB.idAnggota)')
            ->where('penA.idAnggota', $idAnggota)
            ->get()->getRowArray();
---
SELECT `anggota`.*, `penA`.`idAnggota`, `penA`.`idKomunitas`, `penA`.`tanggalPenugasan`, `penA`.`keterangan` AS `keteranganPenugasan`, `penA`.`status` AS `statusPenugasan`, `komunitas`.`nama` AS `namaKomunitas`, `pemA`.`idAnggota`, `pemA`.`idTahapPembinaan`, `pemA`.`tanggalPembinaan`, `tahapPembinaan`.`nama` AS `namaPembinaan`, `pemA`.`keterangan` AS `keteranganPembinaan`, `pemA`.`tanggalPembinaan`, `pemA`.`keterangan` AS `keteranganPembinaan`
FROM `penugasan` `penA`
JOIN `anggota` ON `anggota`.`id` = `penA`.`idAnggota`
JOIN `komunitas` ON `komunitas`.`id` = `penA`.`idKomunitas`
JOIN `pembinaan` `pemA` ON `pemA`.`idAnggota` = `anggota`.`id`
JOIN `tahapPembinaan` ON `tahappembinaan`.`id` = `pemA`.`idTahapPembinaan`
WHERE penA.tanggalPenugasan = (SELECT MAX(tanggalPenugasan) FROM penugasan as penB where penA.idAnggota = `penB`.`idAnggota`)
AND pemA.tanggalPembinaan = (SELECT MAX(tanggalPembinaan) FROM pembinaan as pemB where pemA.idAnggota = `pemB`.`idAnggota`)
AND `penA`.`idAnggota` = '31'

    public function listPenugasanByAnggota($idAnggota)
    {
        return $this->db->table('penugasan')
            ->select('penugasan.*, komunitas.nama')
            ->join('komunitas', 'komunitas.id = penugasan.idKomunitas')
            ->where('penugasan.idAnggota', $idAnggota)
            ->orderBy('tanggalPenugasan', 'DESC')
            ->get()->getResultArray();
---
SELECT `penugasan`.*, `komunitas`.`nama`
FROM `penugasan`
JOIN `komunitas` ON `komunitas`.`id` = `penugasan`.`idKomunitas`
WHERE `penugasan`.`idAnggota` = '31'
ORDER BY `tanggalPenugasan` DESC