app/Models/RelationTable.php

    public function getPenugasan()
    {
        return $this->db->table('penugasan')
            ->join('komunitas', 'komunitas.id = penugasan.idKomunitas')
            ->get()->getResultArray();
---
SELECT `penugasan`.*, `komunitas`.`nama`
FROM `penugasan`
JOIN `komunitas` ON `komunitas`.`id` = `penugasan`.`idKomunitas`